Revit 2027 API
LinePattern Constructor
 Creates a simple line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinePattern()
Public Sub New
public:
LinePattern()
new : unit -> LinePattern
See Also
Reference
LinePattern Class
LinePattern Overload
Autodesk.Revit.DB Namespace